DeltaFinder/soapenv.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
   <soapenv:Body>
      <mes:AcctModRq xmlns:mes="http://MessageView/">
         <MsgRqHdr>
            <ContextRqHdr>
               <FieldSelect>/AcctInfo/IntRateData</FieldSelect>
            </ContextRqHdr>
         </MsgRqHdr>
         <AcctKeys>
            <COID>1</COID>
            <AcctIdent>
               <AcctIdentType>acctnum</AcctIdentType>
               <AcctIdentValue>615</AcctIdentValue>
            </AcctIdent>
            <AcctType>
               <AcctTypeValue>DDA</AcctTypeValue>
            </AcctType>
         </AcctKeys>
         <AcctNewElements>
            <FieldSel>/AcctInfo/IntRateData[IntRateCategory='bonus']/RateMatrixTier[Tier='03']</FieldSel>
            <AcctInfo>
               <IntRateData>
                  <RateMatrixTier>
                     <Tier>03</Tier>
                     <Rate>10.00000</Rate>
                  </RateMatrixTier>
               </IntRateData>
            </AcctInfo>
         </AcctNewElements>
         <AcctUpdElements>
            <FieldSel>/AcctInfo/IntRateData[IntRateCategory='CREDIT']</FieldSel>
            <FieldSel>/AcctInfo/IntRateData[IntRateCategory='bonus']/RateMatrixTier</FieldSel>
            <FieldSel>/AcctInfo/IntRateData[IntRateCategory='bonus']/RateMatrixTier[Tier='02']</FieldSel>
            <AcctInfo>
               <IntRateData>
                  <RateMatrixTier>
                     <Rate>5.45000</Rate>
                  </RateMatrixTier>
                  <IntRateCategory>CREDIT</IntRateCategory>
                  <DailyAccrualCd>A</DailyAccrualCd>
                  <CapFrequency>
                     <RecurrenceType>MONTHLY</RecurrenceType>
                     <DayOfMonth>28</DayOfMonth>
                  </CapFrequency>
                  <IntPlan>87</IntPlan>
                  <IntWaiver>
                     <WaiveCode>00</WaiveCode>
                  </IntWaiver>
                  <IntBase>A</IntBase>
                  <RateMatrixTier>
                     <Rate>5.45000</Rate>
                  </RateMatrixTier>
                  <RateMatrixTier>
                     <Tier>02</Tier>
                  </RateMatrixTier>
               </IntRateData>
               <IntRateData>
                  <RateMatrixTier>
                     <Tier>01</Tier>
                     <Rate>10.00000</Rate>
                     <ExpirationDt>2000-09-30</ExpirationDt>
                  </RateMatrixTier>
                  <RateMatrixTier>
                     <Tier>02</Tier>
                  </RateMatrixTier>
                  <RateMatrixTier>
                     <Tier>09</Tier>
                     <Rate>10.00000</Rate>
                  </RateMatrixTier>
                  <IntRateCategory>BONUS</IntRateCategory>
               </IntRateData>
            </AcctInfo>
         </AcctUpdElements>
      </mes:AcctModRq>
   </soapenv:Body>
</soapenv:Envelope>